In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
database = pd.read_excel("dummy_users.xlsx")
database.head(5)

,id,name,role,salary,age,gender,alive,department,alone,phone_number,city,state,single
0,1,Margaret Moore,Developer,57887,25,Male,No,Operations,No,(254)682-1008x497,Chicago,TX,Yes
1,2,Johnny Mcdowell,Designer,108087,43,Male,No,Finance,No,713.998.3327x6460,Houston,CA,No
2,3,Elizabeth Miller,Manager,68709,42,Female,No,HR,Yes,001-823-068-8392x5295,Los Angeles,CA,Yes
3,4,Lydia Baldwin,Designer,92735,59,Female,No,Operations,No,353-149-4250x81413,Los Angeles,NY,Yes
4,5,John Mccoy,QA,95393,49,Male,No,HR,Yes,(270)652-6399,New York,IL,Yes

In [10]:
minimum : int = database["salary"].min()
print("Minimum value of salary is: ", minimum)

Minimum value of salary is:  49253

In [11]:
maximum : int = database["salary"].max()
print("Maximum value of salary is: ", maximum)

Maximum value of salary is:  112268

In [12]:
range = maximum - minimum
print("Range of salary is: ", range)

Range of salary is:  63015